# notification-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event_retry_0]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 1s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:notification_processor]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event-20230526003447358800000002]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event:lambda-secrets-policy-notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0-20230526003447238600000001]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-eb242819-37a2-4bda-95c8-95845e1d3f58]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0:lambda-secrets-policy-notification_processor_notification_v1_event_retry_0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-09f3f36d-4eb7-4cbd-92a0-6cf27d288db1]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 4s [id=0d52c35207fe1a2827d6152e5e705891731622a3]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 4s [id=0d52c35207fe1a2827d6152e5e705891731622a3]
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Read complete after 4s [id=639c8ec576bcc07f359f403143248de630ae19eb]
module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Read complete after 4s [id=639c8ec576bcc07f359f403143248de630ae19eb]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event_retry_0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_topic: Refreshing state... [id=d170ad90-3271-41cf-959b-843869c7f6ea]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_retry_topics[0]: Refreshing state... [id=5bb04f9b-f58c-429e-a72b-e18a5f0fae8d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0] will be created
  + resource "aws_lambda_event_source_mapping" "kafka_trigger_customer_v1_event_retry_topics" {
      + batch_size                         = 100
      + enabled                            = true
      + function_arn                       = (known after apply)
      + function_name                      = "notification_processor_customer_v1_event_retry_0"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 0
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + starting_position                  = "TRIM_HORIZON"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + topics                             = [
          + "customer.v1.event.retry.0",
        ]
      + uuid                               = (known after apply)

      + self_managed_event_source {
          + endpoints = {
              + "KAFKA_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
            }
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = "urn::connectilly::notification::notification-processor:customer_v1_event_retry_0"
        }

      + source_access_configuration {
          + type = "SASL_SCRAM_512_AUTH"
          + uri  = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T"
        }
    }

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic will be created
  + resource "aws_lambda_event_source_mapping" "kafka_trigger_customer_v1_event_topic" {
      + batch_size                         = 100
      + enabled                            = true
      + function_arn                       = (known after apply)
      + function_name                      = "notification_processor_customer_v1_event"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 0
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + starting_position                  = "TRIM_HORIZON"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + topics                             = [
          + "customer.v1.event",
        ]
      + uuid                               = (known after apply)

      + self_managed_event_source {
          + endpoints = {
              + "KAFKA_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
            }
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = "urn::connectilly::notification::notification-processor:customer_v1_event"
        }

      + source_access_configuration {
          + type = "SASL_SCRAM_512_AUTH"
          + uri  = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T"
        }
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notification_processor_customer_v1_event"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "le-notification_processor_customer_v1_event"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0] will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-notification_processor_customer_v1_event"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "le-notification_processor_customer_v1_event"
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/customer-v1-event/lambda.zip"
      + function_name                  = "notification_processor_customer_v1_event"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "nlxDKJdtlAz1qRW25EeUNhX9qOkdE03iAWYLEF33IyY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notification_processor_customer_v1_event_retry_0"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "le-notification_processor_customer_v1_event_retry_0"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0] will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-notification_processor_customer_v1_event_retry_0"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "le-notification_processor_customer_v1_event_retry_0"
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/customer-v1-event/lambda.zip"
      + function_name                  = "notification_processor_customer_v1_event_retry_0"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "nlxDKJdtlAz1qRW25EeUNhX9qOkdE03iAWYLEF33IyY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "notification"
          + "environment"   = "staging"
          + "resource"      = "notification-processor"
          + "resource_type" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event"
      ~ last_modified                  = "2023-05-26T06:15:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "66tjHcxVvkXL3J7bYxpT3jSqvpODXsJIpjb3XaDweLQ=" -> "N3egLblI5TeYz6bnQQpAhi3csOd9L3pUK8YQhXs58Ps="
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event_retry_0"
      ~ last_modified                  = "2023-05-26T06:15:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "66tjHcxVvkXL3J7bYxpT3jSqvpODXsJIpjb3XaDweLQ=" -> "N3egLblI5TeYz6bnQQpAhi3csOd9L3pUK8YQhXs58Ps="
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "notification"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "notification_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:notification_processor"
        name       = "notification_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "607e6252-ec66-4508-a4e1-0ada8c7b9c5b" -> "f6a33dc8-c64d-48e5-ad22-810f0f09f8e1"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 13 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*